{
    "Home" : {
        "top_slider" :{
            "content"    : "Первый в мире блокчейн позволил играть в шутер от первого лица на нескольких платформах с поддержкой Non-Fungible Token и децентрализованных финансов."
        },
        "ownership" : {
            "the_future_is" : "Будущее",
            "true"          : "верно",
            "ownership!"    : "Владение!",
            "content"       : "Традиционные игры дают вам временное владение вашими внутриигровыми активами, и в тот момент, когда вы выходите из игры, актив исчезает. CitizenFi дает игрокам полное владение своими игровыми активами с помощью технологии блокчейн. Каждый отдельный элемент - это невзаимозаменяемый токен (NFT) на основе блокчейна Ethereum. У вас есть один, он навсегда ваш. Вы можете продать его, подарить, поставить на ставку или использовать в качестве залога.",
            "document"      : "Документ"
        },
        "nft_ecosystem" : {
            "title"     : "Экосистема NFT",
            "content"   : "В арсенале игроков лежит огромное количество неиспользованных игровых активов. Скорее всего, игроки не будут использовать до 70% активов в своем арсенале на протяжении всей сессии. Традиционные игры не дают вам возможности продать его, в то время как другие игры на основе блокчейна дают вам возможность продать его. CitizenFi предлагает несколько вариантов того, что делать с неиспользованными NFT, поскольку они могут вам понадобиться в будущем.",
            "play"      : "В качестве внутриигрового актива NFT можно использовать для игры CitizenFI FPS на мобильных устройствах и ПК.",
            "trade"     : "NFT могут быть выведены из игры и свободно проданы на любом рынке NFT без ограничений.",
            "collateral": "NFT также может использоваться в качестве залога в протоколе кредитования CitizenFi.",
            "leaf"      : "Фермерьте цифровую валюту, размещая неиспользованные NFT в децентрализованных фермерских пулах."
        },
        "about_game" : {
            "title_1"   : "Об",
            "title_2"   : "игре",
            "content_1" : "Citizen Fi: Meta City - это ролевая игра на основе блокчейна, работающая в умной сети Binance. Каждое оружие представляет собой NFT (Non-Fungible Token), который можно использовать для игры, а также делать ставки на децентрализованные пулы.",
            "content_2" : "Северная часть Мета-Сити оккупирована пришельцами с планеты Кайдзин, которые вынудили жителей добывать в Мета-Сити драгоценные металлы сифи. Meta City Company, крупнейшая горнодобывающая компания в городе, наняла военного подрядчика, чтобы помочь спасти некоторые из их работ, застрявших в северной части города, а также выяснить, что инопланетяне хотят от Ciphi."
        },
        "reshaping_industry" : {
            "title"     : "Преобразование индустрии NFT",
            "content"   : "Индустрия NFT, хотя и очень прибыльна, также страдает от особой проблемы - ликвидации. Как цифровые активы Текущие NFT не имеют особой ценности, поскольку активы принадлежат владельцу, и владелец имеет право перепродавать по любой цене, которую он / она хочет. Это может быть хорошо, но также имеет свои отрицательные последствия. NFT можно купить по высокой цене, но вероятность того, что покупатель перепродает по той же цене или выше, редко. Варианта мгновенной ликвидации также не существует, владельцу необходимо искать покупателя, чтобы иметь возможность ликвидировать активы. Мы решили использовать новый механизм для решения этой проблемы.",
            "face_value": "Каждый NFT будет отчеканен с номинальной стоимостью. Токены будут заблокированы в смарт-контракте для чеканки каждой номинальной стоимости NFT. Номинальная стоимость каждого NFT будет эквивалентна заблокированному токену. Владелец может перепродавать по любой цене, если покупатель готов платить.",
            "liquidation" : "NFT может быть немедленно ликвидирован, если не продан. Владелец может сжечь NFT, чтобы получить номинальную стоимость, заблокированную для чеканки актива. При измерении актива по его номинальной стоимости CitizenFi позволяет игрокам брать займы из пулов с их NFT в качестве обеспечения."
        },
        "early_asset_offer" : {
            "title"     : "Раннее предложение активов",
            "content"   : "Ограниченное количество предложений NFT в настоящее время продолжается. Возьмите свой сегодня и наслаждайтесь приключениями и добычей полезных ископаемых."
        },
        "multiple_platforms" : {
            "title"     : "Несколько платформ",
            "content"   : "Вы пользуетесь мобильным телефоном или ПК? Земле нужно, чтобы вы помогли защитить ее от инопланетных захватчиков. Присоединяйтесь к армии гражданина, чтобы сражаться за Землю, сохранить свободу человечества и его культуру, пробиваясь из города в город, нарушая планы захватчиков и освобождая захваченные города."
        },
        "footer" : {
            "subscribe_text" : "Подпишитесь на нашу рассылку.",
            "your_email_address" : "Ваша электронная почта"
        }
    },
    "App" : {
        "Home" : {
            "staking"   : "Ставка",
            "farming"   : "Сельское хозяйство",
            "lending"   : "Кредитование",
            "market"    : "Рынок",
            "my-asset"  : "Мой актив",
            "EAO"       : "EAO",
            "DAO"       : "DAO",
            "modal" : {
                "comingcontent" : "Скоро."
            }
        }
    },
    "words" : {
        "close"         : "Закрыть",
        "collateral"    : "Залог",
        "connect"       : "Подключить",
        "download"   : "Скачать",
        "explore_more"  : "Узнать больше",
        "face_value"    : "Номинальная стоимость",
        "explore"       : "Исследовать",
        "launch_app" : "Запустить приложение",
        "liquidation"   : "Ликвидация",
        "play"          : "Играть в",
        "pools"         : "Пул",
        "subscribe"     : "Подписывайся",
        "swap"          : "Обменять",
        "trade"         : "Сделка",
        "true"       : "Правда"
    }
}